{
  "pageType": "multiple",
  "showAllServicesPage": false,
  "title": "Our Pool & Spa Services",
  "subtitle": "",
  "displayType": "images",
  "services": [
    {
      "title": "Window Cleaning",
      "description": "Crystal clear windows inside and out using premium techniques and purified water systems",
      "icon": "droplets",
      "image": "/uploads/service-1758832593765.jpg",
      "slug": "window-cleaning",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our premium window cleaning service delivers streak-free, crystal clear results using advanced purified water systems and professional-grade squeegees. We clean both interior and exterior surfaces, including screens and sills, ensuring your windows provide the clearest possible view while enhancing your home's curb appeal.",
      "benefits": [
        {
          "title": "Purified Water System",
          "description": "We use advanced water purification technology for spot-free, streak-free results."
        },
        {
          "title": "Interior & Exterior",
          "description": "Complete window cleaning service including screens, sills, and frames."
        },
        {
          "title": "Professional Equipment",
          "description": "Commercial-grade squeegees and tools for superior cleaning results."
        },
        {
          "title": "Satisfaction Guarantee",
          "description": "100% satisfaction guarantee - we'll return if you're not completely happy."
        }
      ]
    },
    {
      "title": "Painting",
      "description": "Professional exterior & interior painting that enhances & protects your Wisconsin Home.",
      "icon": "wrench",
      "image": "https://5.imimg.com/data5/FG/KM/MY-8797479/commercial-painting-services.jpg",
      "slug": "painting",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our professional exterior painting service transforms your home's appearance while protecting it against Wisconsin's harsh weather conditions. We handle everything from surface preparation to final coat application, using premium-grade paints and proven techniques to deliver exceptional quality and durability. PureVue Painting, Coated to Last.",
      "benefits": [
        {
          "title": "Premium Paint Quality",
          "description": "We use only premium, weather-resistant exterior paints specifically formulated to withstand Wisconsin's freeze-thaw cycles and UV exposure."
        },
        {
          "title": "Expert Surface Preparation",
          "description": "Proper preparation is key to lasting results. We thoroughly prepare all surfaces, including power washing, scraping, sanding, and priming as needed."
        },
        {
          "title": "Professional Application",
          "description": "Our skilled painters use professional techniques and equipment to ensure even coverage, clean lines, and a flawless finish that lasts."
        },
        {
          "title": "Color Consultation",
          "description": "Our team helps you choose the perfect color to enhance your home's curb appeal and architectural features with expert design guidance."
        }
      ]
    }
  ],
  "heroCta": {
    "primary": {
      "text": "Get Free Estimate",
      "link": "/contact",
      "enabled": true,
      "color": "accent",
      "textColor": "white"
    },
    "secondary": {
      "text": "Call Now",
      "link": "tel:(512) 359-8746",
      "enabled": false
    }
  }
}